src/cf/InformationRegisters/СостоянияПодключенияЕНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПодключенияЕНС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИнтеграцияПодключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьФоновыйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЖурналирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредельнаяДатаЖурналирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияПодключенияЕНС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ЕстьНастройкаПодключенияЕНС(Организация = Неопределено)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СостоянияПодключенияЕНС.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.СостоянияПодключенияЕНС КАК СостоянияПодключенияЕНС
	|ГДЕ
	|	&УсловиеОрганизация";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ГоловнаяОрганизация = РегламентированнаяОтчетность.ГоловнаяОрганизация(Организация);
		Запрос.УстановитьПараметр("Организация", ГоловнаяОрганизация);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОрганизация", "СостоянияПодключенияЕНС.Организация = &Организация");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОрганизация", "Истина");
		
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	
	ЕстьПодключенияЕНС = Не Результат.Пустой();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЕстьПодключенияЕНС;
	
КонецФункции

Процедура СохранитьПервичнуюНастройкуПодключения(Организация) Экспорт
	
	Если ЕстьНастройкаПодключенияЕНС(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.СостоянияПодключенияЕНС.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура СохранитьФактРегистрацииСервисом(Организация) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СостоянияПодключенияЕНС.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Организация = Организация;
	КонецЕсли;
	МенеджерЗаписи.ИнтеграцияПодключена = Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УстановитьСостояниеПодключения(Организация, ПараметрыСостояния) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СостоянияПодключенияЕНС.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыСостояния);
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСостяниеПодключения(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СтруктураПараметров = СтруктураПараметровСостоянияПодключения();
	МенеджерЗаписи = РегистрыСведений.СостоянияПодключенияЕНС.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, МенеджерЗаписи);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция СтруктураПараметровСостоянияПодключения() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИнтеграцияПодключена", Ложь);
	СтруктураПараметров.Вставить("ИспользоватьФоновыйРежим", Ложь);
	СтруктураПараметров.Вставить("ИспользоватьЖурналирование", Ложь);
	СтруктураПараметров.Вставить("ПредельнаяДатаЖурналирования", Дата(1,1,1));
	
	Возврат СтруктураПараметров;
	
КонецФункции

Процедура ОтключитьЖурналирование(Организация) Экспорт
	
	СостяниеПодключения = ПолучитьСостяниеПодключения(Организация);
	СостяниеПодключения.ИспользоватьЖурналирование = Ложь;
	СостяниеПодключения.ПредельнаяДатаЖурналирования = Дата(1,1,1);
	УстановитьСостояниеПодключения(Организация,СостяниеПодключения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
